# 28: Mengenal explode dan implode list pada Data Frame

### Import Modules

In [2]:
import pandas as pd

print(pd.__version__)

1.3.4

### Data Frame

In [4]:
d = {'Team':['DC', 'Marvel'],
     'Heroes':[['Batman', 'Superman', 'Wonder Woman', 'Aquaman', 'Green Lantern', 'Shazam'],
               ['Iron Man', 'Captain America', 'Ant-Man', 'Black Panther', 'Captain Marvel']]}

df = pd.DataFrame(d)
df

     Team                                             Heroes
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...

### Explode

In [5]:
df1 = df.explode('Heroes') 
df1

# meledakkan sekumpulan data yang nantinya setiap itemnya akan menjadi terpisah

     Team           Heroes
0      DC           Batman
0      DC         Superman
0      DC     Wonder Woman
0      DC          Aquaman
0      DC    Green Lantern
0      DC           Shazam
1  Marvel         Iron Man
1  Marvel  Captain America
1  Marvel          Ant-Man
1  Marvel    Black Panther
1  Marvel   Captain Marvel

### Implode

In [7]:
d = {'Team':['DC', 'Marvel']}
df2 = pd.DataFrame(d)
df2

     Team
0      DC
1  Marvel

In [9]:
df2['Imploded'] = df1.groupby(df1.index)['Heroes'].agg(list)
df2

# menyatukan kembali baris-baris yang terpisah berdasarkan kategori kelompok tertentu untuk disatukan menjadi satu list

     Team                                           Imploded
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...